{"backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"stateful": false, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "trainable": true, "dtype": "float32", "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "name": "lstm_1", "activity_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "implementation": 1, "return_state": false, "go_backwards": false, "units": 512, "dropout": 0.0, "unroll": false, "batch_input_shape": [null, 3, 7], "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "unit_forget_bias": true, "return_sequences": false, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 512, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 15, "activation": "softmax", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "bias_constraint": null}}], "keras_version": "2.1.6", "class_name": "Sequential"}