{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_constraint": null, "recurrent_constraint": null, "units": 256, "stateful": false, "batch_input_shape": [null, 3, 7], "go_backwards": false, "use_bias": true, "activity_regularizer": null, "name": "lstm_1", "trainable": true, "implementation": 1, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dtype": "float32", "dropout": 0.0, "bias_constraint": null, "return_state": false, "recurrent_regularizer": null, "return_sequences": false, "kernel_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "unroll": false, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "name": "dense_1", "trainable": true, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 15, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "name": "dense_2", "trainable": true, "bias_regularizer": null, "activation": "softmax"}}], "keras_version": "2.1.6", "backend": "tensorflow"}